Reports/АнализОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>АнализОстатков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/АнализОстатков/Ext/ObjectModule.bsl
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьТовар = Макет.ПолучитьОбласть("Товар");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	
	ОбластьЗаголовок.Параметры.Дата = Дата;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РегОстатки.Склад КАК Склад,
		|	РегОстатки.Товар КАК Товар,
		|	(РегОстатки.КоличествоКонечныйОстаток) КАК Количество,
		|	-(РегБрони.КоличествоКонечныйОстаток) КАК Забронировано
		|ИЗ
		|	РегистрНакопления.Остатки.ОстаткиИОбороты(&Дата, &Дата, Запись, ДвиженияИГраницыПериода, Порожняя = &Порожняя И Бронь = Ложь) КАК РегОстатки
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Остатки.ОстаткиИОбороты(&Дата, &Дата, Запись, ДвиженияИГраницыПериода, Порожняя = &Порожняя И Бронь = Истина) КАК РегБрони ПО РегОстатки.Товар = РегБрони.Товар И РегОстатки.Склад = РегБрони.Склад
		|ГДЕ
		|	РегОстатки.Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Товар)"
	);
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И РегОстатки.Склад = &Склад";
	КонецЕсли;
	
	Если НЕ Товар.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И (РегОстатки.Товар.Ссылка = &Товар ИЛИ РегОстатки.Товар.Ссылка В ИЕРАРХИИ (&Товар))";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	//|СГРУППИРОВАТЬ ПО
	//|	РегОстатки.Склад,
	//|	РегОстатки.Товар
	|УПОРЯДОЧИТЬ ПО
	|	РегОстатки.Товар.Наименование,
	|	РегОстатки.Товар.Код
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Забронировано)
	|ПО
	|	ОБЩИЕ,
	|	РегОстатки.Товар" + ?(ПоГруппам, " ИЕРАРХИЯ", "") + " 
	|";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("Порожняя", Порожняя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ОбластьОбщийИтог.Параметры.Свободно = ?(ТипЗнч(ВыборкаОбщийИтог.Количество) = Тип("Число"), ВыборкаОбщийИтог.Количество, 0) - ?(ТипЗнч(ВыборкаОбщийИтог.Забронировано) = Тип("Число"), ВыборкаОбщийИтог.Забронировано, 0);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

		ВыборкаТовар = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			Если ВыборкаТовар.Товар.ЭтоГруппа Тогда
				ОбластьГруппа.Параметры.Заполнить(ВыборкаТовар);
				ОбластьГруппа.Параметры.Свободно = ?(ТипЗнч(ВыборкаТовар.Количество) = Тип("Число"), ВыборкаТовар.Количество, 0) - ?(ТипЗнч(ВыборкаТовар.Забронировано) = Тип("Число"), ВыборкаТовар.Забронировано, 0);
				ТабДок.Вывести(ОбластьГруппа, ВыборкаТовар.Уровень());
			Иначе
				ОбластьТовар.Параметры.Заполнить(ВыборкаТовар);
				ОбластьТовар.Параметры.Свободно = ?(ТипЗнч(ВыборкаТовар.Количество) = Тип("Число"), ВыборкаТовар.Количество, 0) - ?(ТипЗнч(ВыборкаТовар.Забронировано) = Тип("Число"), ВыборкаТовар.Забронировано, 0);
				ТабДок.Вывести(ОбластьТовар, ВыборкаТовар.Уровень());
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
КонецПроцедуры
